<!-- add-pr-comment:quicksight_plan -->

# production/quicksight Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudformation_stack.sms-usage-notifications has moved to aws_cloudformation_stack.sms-usage-notifications[0]
    resource "aws_cloudformation_stack" "sms-usage-notifications" {
        id                 = "arn:aws:cloudformation:ca-central-1:296255494825:stack/sms-usage-notifications/948224f0-f1f6-11ee-95e1-02c03de32271"
        name               = "sms-usage-notifications"
        tags               = {}
        # (9 unchanged attributes hidden)
        # (1 unchanged block hidden)
    }
  # aws_cloudwatch_event_rule.step_function_daily_trigger[0] has moved to aws_cloudwatch_event_rule.step_function_daily_trigger
    resource "aws_cloudwatch_event_rule" "step_function_daily_trigger" {
        id                  = "daily-athena-update-table-location"
        name                = "daily-athena-update-table-location"
        tags                = {}
        # (11 unchanged attributes hidden)
    }
  # aws_cloudwatch_event_target.target_with_role[0] has moved to aws_cloudwatch_event_target.target_with_role
    resource "aws_cloudwatch_event_target" "target_with_role" {
        id             = "daily-athena-update-table-location-terraform-20260119024609705000000001"
        # (9 unchanged attributes hidden)
    }
  # aws_iam_role.eventbridge_role[0] has moved to aws_iam_role.eventbridge_role
    resource "aws_iam_role" "eventbridge_role" {
        id                    = "eventbridge-invoke-sfn-role"
        name                  = "eventbridge-invoke-sfn-role"
        tags                  = {}
        # (12 unchanged attributes hidden)
        # (1 unchanged block hidden)
    }
  # aws_iam_role_policy.eventbridge_sfn_invoke_policy[0] has moved to aws_iam_role_policy.eventbridge_sfn_invoke_policy
    resource "aws_iam_role_policy" "eventbridge_sfn_invoke_policy" {
        id          = "eventbridge-invoke-sfn-role:EventBridgeInvokeSFNPolicy"
        name        = "EventBridgeInvokeSFNPolicy"
        # (3 unchanged attributes hidden)
    }
  # aws_quicksight_data_set.notifications has moved to aws_quicksight_data_set.notifications[0]
    resource "aws_quicksight_data_set" "notifications" {
        id             = "296255494825,notifications"
        name           = "Notifications"
        tags           = {}
        # (7 unchanged attributes hidden)
        # (5 unchanged blocks hidden)
    }
  # aws_quicksight_data_source.athena_source will be created
  + resource "aws_quicksight_data_source" "athena_source" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_source_id = "athena-quicksight-data-source"
      + id             = (known after apply)
      + name           = "AthenaDataSource"
      + region         = "ca-central-1"
      + tags_all       = (known after apply)
      + type           = "ATHENA"
      + parameters {
          + athena {
              + work_group = "Notification_quicksight"
            }
        }
      + permission {
          + actions   = [
              + "quicksight:DeleteDataSource",
              + "quicksight:DescribeDataSource",
              + "quicksight:DescribeDataSourcePermissions",
              + "quicksight:PassDataSource",
              + "quicksight:UpdateDataSource",
              + "quicksight:UpdateDataSourcePermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-owners"
        }
      + ssl_properties (known after apply)
    }
  # aws_quicksight_refresh_schedule.notifications has moved to aws_quicksight_refresh_schedule.notifications[0]
    resource "aws_quicksight_refresh_schedule" "notifications" {
        id             = "296255494825,notifications,schedule-notifications"
        # (5 unchanged attributes hidden)
        # (1 unchanged block hidden)
    }
  # aws_quicksight_refresh_schedule.sms-usage-notifications has moved to aws_quicksight_refresh_schedule.sms-usage-notifications[0]
    resource "aws_quicksight_refresh_schedule" "sms-usage-notifications" {
        id             = "296255494825,sms-usage-notifications,schedule-sms-usage-notifications"
        # (5 unchanged attributes hidden)
        # (1 unchanged block hidden)
    }
  # aws_sfn_state_machine.athena_update_table_location will be updated in-place
  ~ resource "aws_sfn_state_machine" "athena_update_table_location" {
      ~ definition                = jsonencode(
          ~ {
              ~ States  = {
                  ~ UpdateTables     = {
                      ~ Iterator   = {
                          ~ States  = {
                              ~ RunAthenaQuery = {
                                  ~ Parameters = {
                                      ~ "QueryString.$"       = "States.Format('ALTER TABLE {}.{} SET LOCATION \"s3://cds-data-lake-raw-production/platform/gc-notify/notification-canada-ca-production-cluster-{}/database/public.{}/1/\";', $.database, $.table_name, $.current_date, $.table_name)" -> "States.Format('ALTER TABLE {}.{} SET LOCATION \"s3://cds-data-lake-raw-production/platform/gc-notify/notification-canada-ca-production-cluster-{}/NotificationCanadaCaproduction/public.{}/1/\";', $.database, $.table_name, $.current_date, $.table_name)"
                                        # (2 unchanged attributes hidden)
                                    }
                                    # (3 unchanged attributes hidden)
                                }
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (4 unchanged attributes hidden)
                    }
                    # (1 unchanged attribute hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id                        = "arn:aws:states:ca-central-1:296255494825:stateMachine:AthenaUpdateTableLocation"
        name                      = "AthenaUpdateTableLocation"
        tags                      = {}
        # (12 unchanged attributes hidden)
        # (3 unchanged blocks hidden)
    }
Plan: 1 to add, 1 to change, 0 to destroy.

# --- End of Plan 1 ---

```